{
    "pageTitle": "Врачам",
    "mainDescription" : "Элайнеры –это еще один способ исправления прикуса и выравнивания зубов.",
    "list": {
        "title": "С помощью элайнеров Майлайн можно провести как объемные работы, так и выровнять только некоторые, беспокоящие Вас зубы. Например, когда пациенту не нравится положение только передних зубов. Мы предлагаем:",
        "items": [
            "Инновационные способы производства и современные материалы обеспечивают уверенность в результате лечения;",
            "Планированием лечения занимается международная команда практикующих врачей-ортодонтовх;",
            "Поддержка докторов на протяжении всего лечения обеспечивают доктора, занимающееся планированием лечения."
        ]
    },
    "cards": [
        {
            "title": "Сканирование/Снятие слепков",
            "description": "Доктор сканирует или снимает слепки пациента. Далее эти слепки отправляются в нашу лабораторию для дальнейшей работы."
        },
        {
            "title": "Составление плана лечения",
            "description": "На основе сканов доктора-ортодонты Майлайн составляют план лечения. На этом этапе будет известно количество элайнеров и срок лечения."
        },
        {
            "title": "Производство элайнеров по вашим слепкам",
            "description": "После согласования плана лечения и оплаты, лаборатория, которая находится в России, производит элайнеры, соблюдая все стандарты."
        },
        {
            "title": "Доставка изделий лечащему врачу",
            "description": "Компания Майлайн отправляет элайнеры курьерской службой. Стоимость доставки уже включена в стоимость, доплачивать не нужно."
        }
    ],
    "joinUsForm": {
        "formTitle": "Оставить заявку",
        "name" : "Ваше имя",
        "phoneNumber" : "Номер телефона",
        "agreement" : "Согласие на обработку персональных данных",
        "required": "Обязательное поле",
        "submitButton": "Зарегистрироваться",
        "notValidName": "Имя введено некорректно",
        "notValidPhoneNumber": "Номер телефона введен некорректно",
        "phoneNumberCharsLimitExceeded" : "Введенный номер телефона превышает максимальное значение поля"
    }
}