{
    "pageTitle": "Врачам",
    "mainDescription" : "Элайнеры – это современный способ исправления прикуса и выравнивания зубов с использованием цифрового протокола.",
    "list": {
        "title": "Сотрудничая с Майлайн, вы приобретете:",
        "items": [
            "Уверенность в результате лечения, благодаря инновационным способам производства и современным материалам.",
            "Консультации с международной командой практикующих врачей-ортодонтов, которые занимаются планированием лечения с помощью системы Майлайн.",
            "Техническую поддержку на протяжении всего лечения.",
            "Адекватную оценку возможности лечения на элайнерах. Клинические случаи не подгоняются под технологии."
        ]
  
  

    },
    "cards": [
        {
            "title": "1. Сканирование/Снятие слепков",
            "description": "Доктор сканирует или снимает слепки пациента. Слепки доставляются в лабораторию Майлайн, сканируются сотрудниками лаборатории. Файлы сканов пересылаются доктору для загрузки в личный кабинет."
        },
        {
            "title": "2. Составление плана лечения",
            "description": "На основе сканов доктора-ортодонты Майлайн составляют план лечения. На этом этапе будет известно количество элайнеров и срок лечения."
        },
        {
            "title": "3. Производство элайнеров по вашим слепкам",
            "description": "После согласования плана лечения и оплаты, лаборатория, которая находится в России, производит элайнеры, соблюдая все стандарты."
        },
        {
            "title": "4. Доставка изделий лечащему врачу",
            "description": "Компания Майлайн отправляет элайнеры курьерской службой. Стоимость доставки уже включена в стоимость, доплачивать не нужно."
        }
    ],
    "joinUsForm": {
        "formTitle": "Оставить заявку",
        "name" : "Ваше имя",
        "phoneNumber" : "Номер телефона",
        "agreement" : "Согласие на обработку персональных данных",
        "required": "Обязательное поле",
        "submitButton": "Зарегистрироваться",
        "notValidName": "Имя введено некорректно",
        "notValidPhoneNumber": "Номер телефона введен некорректно",
        "phoneNumberCharsLimitExceeded" : "Введенный номер телефона превышает максимальное значение поля"
    }
}