export const metadata = {
  title: 'Что могут элайнеры? | Myline' ,
  description: 'Индивидуальное лечение прикуса без неудобств \n\nЭлайнеры Майлайн – это инновационный способ лечения прикуса, который позволяет выровнять зубы с помощью прозрачных и удобных кап. Каждый элайнер изготавливается индивидуально для каждого пациента, что обеспечивает максимально точную и эффективную коррекцию прикуса.',
  keywords: "элайнеры, лечение прикуса, последствия применения, диагнозы, , прозрачные капы, быстрое лечение, комфортное лечение, безопасность",
}

export default function Layout(ctx) {
  return (
    <>
      {ctx.children}  
    </>    
  )
}